#+title: Emacs Literate Config
#+author: Connor Dunning
#+STARTUP: content
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :results silent
#+PROPERTY: header-args:elisp :tangle ./init.el :results silent

This is my Emacs config. It's hopefully declarative and reproducable. To get things up and running:
1. eval the *Straight.el* block.
2. eval the *Org-mode* block, and *Literate Programming* sub item.
3. Save the file, you may have to run *org-babel-tangle* the first time but it should tangle automatically afterwards.
4. ensure 'early-init.el' is present *BEFORE* you restart emacs. It should have been created; if not, copy the code from the *early-init.el* block.

The 'config.org' file will then tangle to 'init.el' when saved, so do that and restart emacs to load any changes.

I'm building this out as I go. I'm not /too/ worried about start up time buuuuut I'm trying to keep things slim.
*Citations* 
- I took plenty of code blocks from David Wilson of https://systemcrafters.net/, his "emacs from scratch" series specifically.
- Coming from DOOM emacs I also took a lot of inspiration from that project (Henrik Lissner) https://github.com/doomemacs/doomemacs.
- A Life Configuring emacs, [[https://alhassy.github.io/][Musa Al-hassy]]

** TODO Reorganize
:PROPERTIES:
:ID:       108326fd-e98f-4a04-9348-60c576778ad9
:END:
In Emacs Lisp, =t= means TRUE and =nil= is equivalent to FALSE. Emacs documentation often mentions setting a value to "non-nil", which is a double negative to suggest setting the variable to true.

#+begin_src elisp
  (setq-default use-short-answers t)
#+end_src

#+RESULTS:
: t

The Scratch Buffer is by default set to Emacs Lisp mode. This is not so useful for authors, so we change this to Org mode and add a new default message.

#+begin_src elisp
      (setq initial-major-mode 'org-mode
  	  initial-scratch-message (concat "#+title: Emacs\n"
  					  "#+subtitle: Scratch Buffer\n\n"
  					  "#The text in this buffer is not saved when exiting Emacs!\n#+begin_src emacs-lisp\n"
  					  "\n\n\n\n"
  					  "#+end_src\n"))
#+end_src

The next two sections of code further improve the Emacs interface with two packages by Emacs guru Protesilaos Stavrou.

The spacious padding package creates space around windows, preventing crammed text on your screen. The =:init= section contains code Emacs evaluates when loading the package. In this case, it enables the Spacious Padding mode. The =:custom= section also sets the line spacing to a more generous value. You can read the manual for this mode with =C-h R spacious=.

This configuration also modifies the ~line-spacing~ variable to create some space between logical lines. This variable is not part of the Spacious Padding package.

#+begin_src elisp :tangle no
  (use-package spacious-padding
    :custom
    (line-spacing 3)
    (spacious-padding-mode 1))
#+end_src

#+begin_src emacs-lisp
(which-key-add-key-based-replacements
      "C-c w"   "Emacs Writing Studio"
      "C-c w b" "Bibliographic"
      "C-c w d" "Denote"
      "C-c w m" "Multimedia"
      "C-c w s" "Spelling and Grammar"
      "C-c w t" "Themes"
      "C-c w x" "Explore")
#+end_src

#+begin_src elisp
  (when (display-graphic-p)
    (context-menu-mode))
#+end_src


#+begin_src elisp
  (use-package flyspell
    :custom
    (ispell-program-name "hunspell")
    (ispell-dictionary ews-hunspell-dictionaries)
    (flyspell-mark-duplications-flag nil) ;; Writegood mode does this
    (org-fold-core-style 'overlays) ;; Fix Org mode bug
    :config
    (ispell-set-spellchecker-params)
    (ispell-hunspell-add-multi-dic ews-hunspell-dictionaries)
    :hook
    (text-mode . flyspell-mode)
    :bind
    (("C-c w s s" . ispell)
     ("C-;"       . flyspell-auto-correct-previous-word)))
#+end_src

some org variables
#+begin_src emacs-lisp
(setq
    org-pretty-entities t
    org-use-sub-superscripts "{}"
    org-id-link-to-org-use-id t
    org-fold-catch-invisible-edits 'show)
#+end_src

#+begin_src elisp  
  (use-package org-appear
    :hook
    (org-mode . org-appear-mode))
#+end_src

The Org Fragtog package is similar to Org Appear but for LaTeX snippets. It automatically toggles Org mode LaTeX fragment previews as the cursor enters and exits them. By default, the text is small and can become unreadable when changing between dark and light themes.

The =org-format-latex-options= variable controls the way Emacs presents fragments. This variable is a list with properties such as colours and size. The =plist-put= function lets you change options in the list. The foreground and background are set to take the same colour as your text. If you change from dark to light mode or vice versa, you should evaluate the ~org-latex-preview~ function (=C-c C-x C-l=) to change the preview images.

Automated LaTeX previews are disabled because they can delay loading a page and cause trouble when the user does not have LaTeX installed.

#+begin_src elisp
  (use-package org-fragtog
    :after org
    :hook
    (org-mode . org-fragtog-mode)
    :custom
    (org-startup-with-latex-preview nil)
    (org-format-latex-options
     (plist-put org-format-latex-options :scale 2)
     (plist-put org-format-latex-options :foreground 'auto)
     (plist-put org-format-latex-options :background 'auto)))
#+end_src

#+RESULTS:
| org-fragtog-mode | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | org-tempo-setup | #[nil ((add-hook 'after-save-hook #'efs/org-babel-tangle-config)) (bootstrap-version t)] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | efs/org-mode-setup | #[nil ((display-line-numbers-mode 0)) (t)] |

I can't get pdf-tools working anyway
#+begin_src elisp
  (use-package doc-view
    :custom
    (doc-view-resolution 300)
    (large-file-warning-threshold (* 50 (expt 2 20))))
#+end_src

